app/controllers/beers_controller.rb

SELECT `beers`.* FROM `beers` WHERE `beers`.`id` = 3 LIMIT 1
---
  def show
    @beer = Beer.find_by(id: params[:id])

SELECT `beers`.* FROM `beers` ORDER BY RAND() LIMIT 1
---
  def index
    @beers = Beer.all

SELECT `beers`.* FROM `beers` ORDER BY RAND() LIMIT 1
---
  def random
    @beer = Beer.order('RAND()').first

INSERT INTO `beers` (`name`, `description`, `image_url`, `created_at`, `updated_at`) VALUES ('string', 'string', 'string', '2025-01-02 16:12:27.557563', '2025-01-02 16:12:27.557563')
---
  def create
    @beer = Beer.new(beer_params)
    if @beer.save

SELECT `beers`.* FROM `beers` WHERE `beers`.`id` = 2 LIMIT 1
UPDATE `beers` SET `beers`.`name` = 'Petra', `beers`.`description` = 'Uma cerveja adocicada e que cabe no seu bolso', `beers`.`image_url` = 'null', `beers`.`updated_at` = '2025-01-02 16:03:35.485826' WHERE `beers`.`id` = 2
---
  def update
    @beer = Beer.find(params[:id])
    if @beer.update(beer_params)

SELECT `beers`.* FROM `beers` WHERE `beers`.`id` = 2 LIMIT 1
DELETE FROM `beers` WHERE `beers`.`id` = 2
---
  def destroy
    @beer = Beer.find(params[:id])
    @beer.destroy